// Задание 17: Объявите и вызовите функцию `print`, которая принимает строку
// выводит её на консоль.

#include <iostream>
using namespace std;

void print(string str) {
    cout << str;
}

int main()
{
    print("Hello");
    return 0;
}

